#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.template_file.user_data: Reading...
data.template_file.cloud_init: Reading...
data.template_file.cloud_init: Read complete after 0s [id=518d3a8659770fca05891fd6087f2465f40b4751d66090536e4d9857bf04b7e4]
data.template_file.user_data: Read complete after 0s [id=1ef8e20b627f16b858bec1ffc90b7175baf6be804649bf4fda84d7a2e85eb2ca]
data.template_cloudinit_config.user_data: Reading...
data.template_cloudinit_config.user_data: Read complete after 0s [id=1346389820]
aws_ecr_repository.services: Refreshing state... [id=test-service-ecr]
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-094cab60aef0903e5]
aws_s3_bucket.scripts: Refreshing state... [id=test-scripts-bucket-xhcy]
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0c73dbe40ea87750d]
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_api_service.aws_iam_role.this: Refreshing state... [id=test-api-service-role]
module.ec2_math_service.aws_iam_role.this: Refreshing state... [id=test-math-service-role]
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_nats_service.aws_iam_role.this: Refreshing state... [id=test-nats-service-role]
module.ec2_calculator_service.aws_iam_role.this: Refreshing state... [id=test-calculator-service-role]
module.ec2_nats_service.aws_iam_instance_profile.this: Refreshing state... [id=test-nats-service-profile]
module.ec2_calculator_service.aws_iam_instance_profile.this: Refreshing state... [id=test-calculator-service-profile]
module.ec2_math_service.aws_iam_instance_profile.this: Refreshing state... [id=test-math-service-profile]
module.ec2_api_service.aws_iam_instance_profile.this: Refreshing state... [id=test-api-service-profile]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0089974f1ab1ecd33]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-023258a70b4ee1dfe]
module.ec2_math_service.aws_security_group.this: Refreshing state... [id=sg-0cd3b1349ef53991b]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c40a91d41558fb89]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-05eef14c47462aacc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a3a790c6a101878a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-063cd84df58f0a7cf]
aws_lb_target_group.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44]
module.ec2_calculator_service.aws_security_group.this: Refreshing state... [id=sg-04cfab8f8095d1e68]
aws_security_group.alb: Refreshing state... [id=sg-0e15f3494d5f284d9]
module.ec2_nats_service.aws_security_group.this: Refreshing state... [id=sg-0afe2f2e5bdac2779]
module.ec2_api_service.aws_security_group.this: Refreshing state... [id=sg-02ef0cb83fc65120e]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0a49b312ac97b8378]
module.vpc.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0c40a91d41558fb891080289494]
module.ec2_math_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-1427775919]
module.ec2_calculator_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3289685051]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-030d7ef89909fcb05]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f516d925e00098e4]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0903d2a17cf5fd0bd]
module.ec2_math_service.aws_instance.this: Refreshing state... [id=i-07876466f816a676c]
module.ec2_calculator_service.aws_instance.this: Refreshing state... [id=i-067222514365fb132]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:loadbalancer/app/test-alb/656e0c06319ca41b]
aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-1187814955]
module.ec2_nats_service.aws_instance.this: Refreshing state... [id=i-06875b90cc4355451]
module.ec2_nats_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3257684970]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e8dbc266c9e5c932]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a42a96945621d549]
module.ec2_api_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-4227132091]
module.ec2_api_service.aws_instance.this: Refreshing state... [id=i-07c09f39e8a8d7e08]
module.ec2_api_service.aws_security_group_rule.ingress["allow_from_https"]: Refreshing state... [id=sgrule-1539870380]
aws_s3_object.script_service: Refreshing state... [id=scripts/deploy-service.sh]
aws_s3_bucket_acl.scripts: Refreshing state... [id=test-scripts-bucket-xhcy,private]
aws_s3_object.script_nats: Refreshing state... [id=scripts/deploy-nats.sh]
module.vpc.aws_route.private: Refreshing state... [id=r-rtb-0a49b312ac97b83781080289494]
aws_security_group_rule.alb_egress: Refreshing state... [id=sgrule-1042729509]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_api"]: Refreshing state... [id=sgrule-4288993160]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_calculator"]: Refreshing state... [id=sgrule-2857923659]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_math"]: Refreshing state... [id=sgrule-137509963]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/085db943cf6ef8f7]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/c2de448f3f0c4bfc]
aws_lb_listener_rule.api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener-rule/app/test-alb/656e0c06319ca41b/c2de448f3f0c4bfc/361fb090b55d3b30]
aws_ssm_parameter.service: Refreshing state... [id=/test/services]
aws_lb_target_group_attachment.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44-20230310100020756500000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group_rule.alb_ingress_https will be created
  + resource "aws_security_group_rule" "alb_ingress_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e15f3494d5f284d9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @artpasut, Action: `pull_request`*